<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class PostTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('post')->delete();
        
        \DB::table('post')->insert(array (
            0 => 
            array (
                'id' => 1,
                'title' => 'فضائل شهر رمضان',
                'content' => 'شهر رمضان هو أفضل أشهر السنة، خصه الله بنزول القرآن الكريم، وليلة القدر التي هي خير من ألف شهر، وفيه
تُفتح أبواب الجنة وتغلق أبواب النار وتصفد الشياطين. صومه إيمانًا واحتسابًا سبب لمغفرة الذنوب، وهو شهر العتق من النار، وصيامه جنة ووقاية، ودعوة الصائم فيه مستجابة.',
                'created_at' => '2026-02-16 21:39:52',
                'updated_at' => '2026-03-28 11:02:52',
            ),
            1 => 
            array (
                'id' => 2,
                'title' => 'فضل الإجتهاد في رمضان',
                'content' => 'عن  عائشة رضي الله عنها: كان رسول الله  يجتهد في رمضان ما لا يجتهد في غيره. أخرجه مسلم.',
                'created_at' => '2026-03-13 18:01:44',
                'updated_at' => '2026-03-28 10:53:38',
            ),
            2 => 
            array (
                'id' => 3,
                'title' => 'العيد عند المسلمين',
                'content' => 'عن أنس قال: قدم رسول الله صلى الله عليه وسلم المدينة ولهم يومان يلعبون فيهما، فقال: "ما هذان اليومان؟" قالوا: كنا نلعب فيهما في الجاهلية، فقال رسول الله صلى الله عليه وسلم: "إن الله قد أبدلكم بهما خيرا منهما: يوم الأضحى، ويوم الفطر". رواه أبو داود والنسائي',
                'created_at' => '2026-03-28 11:08:19',
                'updated_at' => '2026-03-28 11:08:19',
            ),
        ));
        
        
    }
}